#+TITLE:	Music History
#+SUBTITLE:	Log
#+OPTIONS:	toc:nil num:nil
#+STARTUP:	indent show2levels
#+CATEGORY:	Projects
#+TAGS:		log python MusicHistory MusicAnalytics smplayer mpv sql databases

* Thursday, February 16, 2023
:LOGBOOK:
CLOCK: [2023-02-16 Thu 03:15]--[2023-02-16 Thu 04:00] =>  0:45
:END:
* Tuesday, December 27, 2022
:LOGBOOK:
CLOCK: [2022-12-27 Tue 05:15]--[2022-12-27 Tue 07:15] =>  2:00
:END:
* Saturday, December 24, 2022
:LOGBOOK:
CLOCK: [2022-12-24 Sat 14:45]--[2022-12-24 Sat 16:15] =>  1:30
CLOCK: [2022-12-24 Sat 06:30]--[2022-12-24 Sat 10:00] =>  3:30
:END:
* Thursday, December 22, 2022
:LOGBOOK:
CLOCK: [2022-12-22 Thu 04:00]--[2022-12-22 Thu 10:30] =>  6:30
:END:
* Wednesday, December 21, 2022
:LOGBOOK:
CLOCK: [2022-12-21 Wed 10:00]--[2022-12-21 Wed 12:00] =>  2:00
CLOCK: [2022-12-21 Wed 04:00]--[2022-12-21 Wed 09:00] =>  5:00
:END:
* Tuesday, December 20, 2022
:LOGBOOK:
CLOCK: [2022-12-20 Tue 08:00]--[2022-12-20 Tue 11:30] =>  3:30
:END:
* Monday, December 19, 2022
:LOGBOOK:
CLOCK: [2022-12-19 Mon 05:00]--[2022-12-19 Mon 08:00] =>  3:00
:END:
* Saturday, December 17, 2022
:LOGBOOK:
CLOCK: [2022-12-17 Sat 05:00]--[2022-12-17 Sat 10:30] =>  5:30
:END:
* Wednesday, December 14, 2022
:LOGBOOK:
CLOCK: [2022-12-14 Wed 08:30]--[2022-12-14 Wed 11:30] =>  3:00
CLOCK: [2022-12-14 Wed 03:30]--[2022-12-14 Wed 07:30] =>  4:00
:END:
* Tuesday, December 13, 2022
:LOGBOOK:
CLOCK: [2022-12-13 Tue 16:00]--[2022-12-13 Tue 18:15] =>  2:15
:END:
* Sunday, December 11, 2022
:LOGBOOK:
CLOCK: [2022-12-11 Sun 05:00]--[2022-12-11 Sun 06:45] =>  1:45
:END:
* Saturday, December 10, 2022
:LOGBOOK:
CLOCK: [2022-12-10 Sat 04:00]--[2022-12-10 Sat 05:30] =>  1:30
:END:
* Friday, December 9, 2022
:LOGBOOK:
CLOCK: [2022-12-09 Fri 17:15]--[2022-12-09 Fri 17:45] =>  0:30
CLOCK: [2022-12-09 Fri 14:45]--[2022-12-09 Fri 16:15] =>  1:30
CLOCK: [2022-12-09 Fri 10:00]--[2022-12-09 Fri 11:30] =>  1:30
CLOCK: [2022-12-09 Fri 07:00]--[2022-12-09 Fri 09:30] =>  2:30
:END:
* Thursday, December 8, 2022
:LOGBOOK:
CLOCK: [2022-12-08 Thu 12:00]--[2022-12-08 Thu 13:00] =>  1:00
CLOCK: [2022-12-08 Thu 05:00]--[2022-12-08 Thu 09:00] =>  4:00
:END:
* Wednesday, December 7, 2022
:LOGBOOK:
CLOCK: [2022-12-07 Wed 16:45]--[2022-12-07 Wed 18:15] =>  1:30
CLOCK: [2022-12-07 Wed 08:00]--[2022-12-07 Wed 11:30] =>  3:30
CLOCK: [2022-12-07 Wed 04:00]--[2022-12-07 Wed 07:00] =>  3:00
:END:
* Tuesday, December 6, 2022
:LOGBOOK:
CLOCK: [2022-12-06 Tue 16:00]--[2022-12-06 Tue 18:00] =>  2:00
CLOCK: [2022-12-06 Tue 07:45]--[2022-12-06 Tue 12:15] =>  4:30
:END:
* Monday, December 5, 2022
:LOGBOOK:
CLOCK: [2022-12-05 Mon 15:00]--[2022-12-05 Mon 18:00] =>  3:00
CLOCK: [2022-12-05 Mon 07:45]--[2022-12-05 Mon 11:45] =>  4:00
CLOCK: [2022-12-05 Mon 04:45]--[2022-12-05 Mon 07:15] =>  2:30
CLOCK: [2022-12-05 Mon 04:00]--[2022-12-05 Mon 04:30] =>  0:30
:END:
* Sunday, December 4, 2022
:LOGBOOK:
CLOCK: [2022-12-04 Sun 15:00]--[2022-12-04 Sun 18:00] =>  3:00
CLOCK: [2022-12-04 Sun 10:00]--[2022-12-04 Sun 12:30] =>  2:30
CLOCK: [2022-12-04 Sun 08:30]--[2022-12-04 Sun 09:00] =>  0:30
CLOCK: [2022-12-04 Sun 04:10]--[2022-12-04 Sun 07:30] =>  3:20
:END:
* Saturday, December 3, 2022
:LOGBOOK:
CLOCK: [2022-12-03 Sat 16:00]--[2022-12-03 Sat 16:50] =>  0:50
CLOCK: [2022-12-03 Sat 04:00]--[2022-12-03 Sat 05:30] =>  1:30
:END:
* Friday, December 2, 2022
:LOGBOOK:
CLOCK: [2022-12-02 Fri 16:00]--[2022-12-02 Fri 17:15] =>  1:15
CLOCK: [2022-12-02 Fri 05:00]--[2022-12-02 Fri 06:30] =>  1:30
:END:
* Thursday, December 1, 2022
:LOGBOOK:
CLOCK: [2022-12-01 Thu 17:00]--[2022-12-01 Thu 18:15] =>  1:15
CLOCK: [2022-12-01 Thu 08:30]--[2022-12-01 Thu 09:15] =>  0:45
CLOCK: [2022-12-01 Thu 06:00]--[2022-12-01 Thu 07:30] =>  1:30
CLOCK: [2022-12-01 Thu 00:30]--[2022-12-01 Thu 01:53] =>  1:23
:END:
* Wednesday, November 30, 2022
:LOGBOOK:
CLOCK: [2022-11-30 Wed 04:00]--[2022-11-30 Wed 04:15] =>  0:15
:END:
* Tuesday, November 29, 2022
:LOGBOOK:
CLOCK: [2022-11-29 Tue 19:30]--[2022-11-29 Tue 19:55] =>  0:25
CLOCK: [2022-11-29 Tue 16:45]--[2022-11-29 Tue 17:20] =>  0:35
CLOCK: [2022-11-29 Tue 11:35]--[2022-11-29 Tue 12:35] =>  1:00
CLOCK: [2022-11-29 Tue 04:00]--[2022-11-29 Tue 07:30] =>  3:30
CLOCK: [2022-11-29 Tue 09:15]--[2022-11-29 Tue 11:15] =>  2:00
:END:
* Monday, November 28, 2022
:LOGBOOK:
CLOCK: [2022-11-28 Mon 14:00]--[2022-11-28 Mon 14:30] =>  0:30
CLOCK: [2022-11-28 Mon 08:30]--[2022-11-28 Mon 10:00] =>  1:30
CLOCK: [2022-11-28 Mon 05:25]--[2022-11-28 Mon 06:55] =>  1:30
CLOCK: [2022-11-28 Mon 04:00]--[2022-11-28 Mon 05:00] =>  1:00
:END:
* Sunday, November 27, 2022
:LOGBOOK:
CLOCK: [2022-11-27 Sun 17:20]--[2022-11-27 Sun 18:23] =>  1:03
CLOCK: [2022-11-27 Sun 15:45]--[2022-11-27 Sun 17:00] =>  1:15
CLOCK: [2022-11-27 Sun 05:00]--[2022-11-27 Sun 12:30] =>  7:30
:END:
* Saturday, November 26, 2022
:LOGBOOK:
CLOCK: [2022-11-26 Sat 06:00]--[2022-11-26 Sat 10:00] =>  4:00
:END:
- More fiddling with ~dim_date~--I think I'm going to turn this into its own project
  
* Friday, November 25, 2022
:LOGBOOK:
CLOCK: [2022-11-25 Fri 17:15]--[2022-11-25 Fri 17:40] =>  0:25
:END:
- I got the date dimension table, ~dim_date~, so it contains week-related columns with Sunday as the first day of the week (non-ISO)
- I am surprised that this isn't part of PostgreSQL
- Now, I can continue with building playlists
- Fix year in week 53 (ie. first week of 1977)

* Thursday, November 24, 2022
:LOGBOOK:
CLOCK: [2022-11-24 Thu 04:05]--[2022-11-24 Thu 11:45] =>  7:40
:END:
* Tuesday, November 22, 2022
:LOGBOOK:
CLOCK: [2022-11-22 Tue 10:30]--[2022-11-22 Tue 12:30] =>  2:00
CLOCK: [2022-11-22 Tue 05:00]--[2022-11-22 Tue 06:35] =>  1:35
:END:
* Monday, November 21, 2022
:LOGBOOK:
CLOCK: [2022-11-21 Mon 07:00]--[2022-11-21 Mon 12:32] =>  5:32
:END:
- Working on Top XX lists
- I created a bunch of lists, but it looks like I need to correct the SQL for Daily lists

* Sunday, November 20, 2022
:LOGBOOK:
CLOCK: [2022-11-20 Sun 12:45]--[2022-11-20 Sun 13:10] =>  0:25
:END:
- Updated SQL for generating TOP XX lists using DBeaver

* Wednesday, November 2, 2022
:LOGBOOK:
CLOCK: [2022-11-02 Wed 07:54]--[2022-11-02 Wed 09:44] =>  1:50
CLOCK: [2022-11-02 Wed 03:19]--[2022-11-02 Wed 04:54] =>  1:35
:END:
- It seems that the midnight run of ~log_analyzer~ failed because I forgot to install it, but 
  * When I ran it manually, nothing happened
  * I had to delete the summary file, ~20221101.csv.xz~, in order for it to run
    + I want to eliminate the need for the CSV files, altogether
    + I started with adding ~SAVE_SUMMARIES~ to the environment / configuration
- After creating a date dimension table, it seems appropriate to create a file dimension
  * A folder dimension seems to be part of this, and I have already worked on these things with FileInfo and FolderInfo classes in Python

* Tuesday, November 1, 2022
:LOGBOOK:
CLOCK: [2022-11-01 Tue 04:27]--[2022-11-01 Tue 12:09] =>  7:42
:END:
- Examining whether or not there should be a DATE column in ~dt_log_analyzer~, for use in ~JOIN~ statements
  * I tested this with ~dt_playinfo_test~ and it works well
  * I can see this eliminating the need for the CSV files in the ~Summaries~ directory, altogether
- Renamed ~d_date~ to ~dim_date~, for now

* Friday, October 28, 2022
:LOGBOOK:
CLOCK: [2022-10-28 Fri 15:27]--[2022-10-28 Fri 18:29] =>  3:02
:END:
- Added date dimension table, ~d_date~

* Wednesday, October 26, 2022
:LOGBOOK:
CLOCK: [2022-10-26 Wed 04:12]--[2022-10-26 Wed 04:15] =>  0:03
:END:
- ~log_analyzer~ ran overnight, without a hitch; the ~to_sql~ function is using ~append~ now, instead of ~replace~

* Tuesday, October 25, 2022
:LOGBOOK:
CLOCK: [2022-10-25 Tue 16:53]--[2022-10-25 Tue 17:16] =>  0:23
CLOCK: [2022-10-25 Tue 11:38]--[2022-10-25 Tue 12:58] =>  1:20
CLOCK: [2022-10-25 Tue 04:15]--[2022-10-25 Tue 07:22] =>  3:07
:END:
- Moved ~config.py~ from ~src/musichistory~ to ~~/.config/MusicHistory~; this seems to make the ~.env~ file irrelevant, unless I also move it
- ~log_analyzer2~ has been merged into ~log_extractor~
- Imported the old ~smplayer_history~ file (~20220518.csv.xz~)
- The database now contains all of the music history data

* Monday, October 24, 2022
:LOGBOOK:
CLOCK: [2022-10-24 Mon 14:36]--[2022-10-24 Mon 16:32] =>  1:56
CLOCK: [2022-10-24 Mon 04:24]--[2022-10-24 Mon 06:21] =>  1:57
:END:
- After binge-watching /St. Elsewhere/ and /The X-Files/, I have actually been listening to music for the last couple of days, so it is time to work on the Top XXX lists
- I see the database has incorrect timestamps (in the future)
  * ~log_extractor~ - This is where timestamps and filenames are extracted from the SMPlayer logs and CSV summaries are created; I moved the logic to convert timestamps here, since they are correct
  * Re-running ~log_extractor~ on the entire dataset (150 days worth)
- The ~MusicHistory~ folder is 56 GB in size!
  * Compressed about 150 file with ~xz~ and got it down to 2.1 GB
- Ready to combine ~log_extractor2~ and ~log_analyzer~
- Created ~touchdirs2.py~ as a scratch file, as a replacement for ~touchdirs~
  * It uses ~os.walk~ and is both faster and simpler than I expected
  * It isn't ready for production-use, yet--I need to code logic for filetypes like MP4

* Friday, June 17, 2022
:LOGBOOK:
CLOCK: [2022-06-17 Fri 15:42]--[2022-06-17 Fri 18:23] =>  2:41
CLOCK: [2022-06-17 Fri 12:20]--[2022-06-17 Fri 12:32] =>  0:12
CLOCK: [2022-06-17 Fri 06:55]--[2022-06-17 Fri 07:22] =>  0:27
:END:
- Moved ~Music-Analytics~ from the old ~MusicHistory~ project to the ~bin~ directory and renamed it to ~log_analyzer~, to standardize the command names
  * It doesn't work with the new log files, yet
  * I'm not sure how to add any of these as commands to the project, so that they will be installed, but that can come later
- The CSV files have Unix timestamps, but Pandas ~to_datetime()~  function doesn't produce the correct date, so I will try it in the database, instead
- Created baseline for ~developmentdb.media_library~ 

* Tuesday, June 14, 2022
:LOGBOOK:
CLOCK: [2022-06-14 Tue 14:05]--[2022-06-14 Tue 16:23] =>  2:18
CLOCK: [2022-06-14 Tue 09:34]--[2022-06-14 Tue 11:02] =>  1:28
:END:
- After mucking-about with multidb and schemas, it looks like I misunderstood what ~multidb~ is all about
  * My app only uses one database, so the ~--multidb~ option when initializing alembic is unnecessary
  * Multiple schemas can be used with a single database by way of the ~--name~ option and corresponding section in ~alembic.ini~
- Alembic Test #3 was supposed to use the ~development~ schema, ~media_library~ but it used ~alembic_test~, as specified in ~.env~
- Alembic Test #4 was successful, after I temporarily renamed ~dt_fileinfo~, in order to verify that the upgrade script works
  * It should be noted that Alembic uses the environment set in ~models.py~, not ~alembic.ini~
* Monday, June 13, 2022
:LOGBOOK:
CLOCK: [2022-06-13 Mon 20:07]--[2022-06-13 Mon 22:11] =>  2:04
CLOCK: [2022-06-13 Mon 13:33]--[2022-06-13 Mon 18:09] =>  4:36
CLOCK: [2022-06-13 Mon 08:48]--[2022-06-13 Mon 12:24] =>  3:36
:END:
- Alembic Reference: [[https://learningtotest.com/2021/06/17/managing-alembic-migrations-with-a-single-alembic-ini-env-py/][Alembic Configuration]]
  * I think I need to change ~models.py~ to use ~create_engine~, if I am going to get this to work
- Another Reference: [[https://elarkk.github.io/blog/multi-schema-sqlalchemy][Multi-schema Postgres database handling through SQLAlchemy]]
  * This one needs work
- I was trying to get Alembic to handle multiple databases and schemas, but it isn't working
  * My current configuration does store the schema with the SQL operations, which is a good thing



